create_clock -period 8.000 -name eth_rxc -waveform {2.000 6.000} [get_ports eth_rxc]
create_clock -period 8.000 -name RGMII_1_rxc -waveform {0.000 4.000} [get_ports RGMII_1_rxc]
create_clock -period 8.000 -name eth_rxc_v -waveform {0.000 4.000}
create_clock -period 8.000 -name eth_txc_v -waveform {4.000 8.000}
create_generated_clock -name dri_clk -source [get_pins system_i/adaptive_udp_0/gmii_rx_clk] -divide_by 2 [get_pins system_i/adaptive_udp_0/dri_clk]
create_generated_clock -name system_i/mdio_rw_test_0/inst/u_mdio_dri/dri_clk_reg_0 -source [get_pins {system_i/processing_system7_0/inst/PS7_i/FCLKCLK[0]}] -divide_by 8 [get_pins system_i/mdio_rw_test_0/inst/u_mdio_dri/dri_clk_reg/Q]
create_generated_clock -name eth_txc -source [get_pins system_i/gmii2rgmii_0/rgmii_rxc] -multiply_by 1 [get_ports eth_txc]
set_input_delay -clock [get_clocks eth_rxc_v] -max -add_delay 1.300 [get_ports {eth_rxd[*]}]
set_input_delay -clock [get_clocks eth_rxc_v] -min -add_delay -0.300 [get_ports {eth_rxd[*]}]
set_input_delay -clock [get_clocks eth_rxc_v] -clock_fall -max -add_delay 1.300 [get_ports {eth_rxd[*]}]
set_input_delay -clock [get_clocks eth_rxc_v] -clock_fall -min -add_delay -0.300 [get_ports {eth_rxd[*]}]
set_input_delay -clock [get_clocks eth_rxc_v] -max -add_delay 1.300 [get_ports eth_rx_ctl]
set_input_delay -clock [get_clocks eth_rxc_v] -min -add_delay -0.300 [get_ports eth_rx_ctl]
set_input_delay -clock [get_clocks eth_rxc_v] -clock_fall -max -add_delay 1.300 [get_ports eth_rx_ctl]
set_input_delay -clock [get_clocks eth_rxc_v] -clock_fall -min -add_delay -0.300 [get_ports eth_rx_ctl]
set_output_delay -clock [get_clocks eth_txc_v] -max -add_delay -0.500 [get_ports {eth_txd[*]}]
set_output_delay -clock [get_clocks eth_txc_v] -min -add_delay -2.500 [get_ports {eth_txd[*]}]
set_output_delay -clock [get_clocks eth_txc_v] -clock_fall -max -add_delay -0.500 [get_ports {eth_txd[*]}]
set_output_delay -clock [get_clocks eth_txc_v] -clock_fall -min -add_delay -2.500 [get_ports {eth_txd[*]}]
set_output_delay -clock [get_clocks eth_txc_v] -max -add_delay -0.500 [get_ports eth_tx_ctl]
set_output_delay -clock [get_clocks eth_txc_v] -min -add_delay -2.500 [get_ports eth_tx_ctl]
set_output_delay -clock [get_clocks eth_txc_v] -clock_fall -max -add_delay -0.500 [get_ports eth_tx_ctl]
set_output_delay -clock [get_clocks eth_txc_v] -clock_fall -min -add_delay -2.500 [get_ports eth_tx_ctl]
set_false_path -fall_from [get_clocks eth_rxc_v] -rise_to [get_clocks eth_rxc]
set_false_path -rise_from [get_clocks eth_rxc_v] -fall_to [get_clocks eth_rxc]
set_false_path -rise_from [get_clocks eth_rxc_v] -rise_to [get_clocks eth_rxc]
set_false_path -fall_from [get_clocks eth_rxc_v] -fall_to [get_clocks eth_rxc]
set_false_path -fall_from [get_clocks eth_txc_v] -rise_to [get_clocks eth_txc]
set_false_path -rise_from [get_clocks eth_txc_v] -fall_to [get_clocks eth_txc]
set_false_path -rise_from [get_clocks eth_txc_v] -rise_to [get_clocks eth_txc]
set_false_path -fall_from [get_clocks eth_txc_v] -fall_to [get_clocks eth_txc]
set_false_path -fall_from [get_clocks eth_rxc] -rise_to [get_clocks eth_txc_v]
set_false_path -rise_from [get_clocks eth_rxc] -fall_to [get_clocks eth_txc_v]
set_false_path -rise_from [get_clocks eth_rxc] -rise_to [get_clocks eth_txc_v]
set_false_path -fall_from [get_clocks eth_rxc] -fall_to [get_clocks eth_txc_v]
set_clock_groups -name clk_async2 -asynchronous -group [get_clocks clk_fpga_0] -group [get_clocks eth_rxc]

set_property PACKAGE_PIN E16 [get_ports {led[1]}]
set_property PACKAGE_PIN F16 [get_ports {led[0]}]
set_property PACKAGE_PIN C15 [get_ports eth_mdc]
set_property PACKAGE_PIN B15 [get_ports eth_mdio]
set_property PACKAGE_PIN H17 [get_ports eth_rst_n]
set_property PACKAGE_PIN C22 [get_ports {eth_rxd[0]}]
set_property PACKAGE_PIN D22 [get_ports {eth_rxd[1]}]
set_property PACKAGE_PIN D21 [get_ports {eth_rxd[2]}]
set_property PACKAGE_PIN E21 [get_ports {eth_rxd[3]}]
set_property PACKAGE_PIN A17 [get_ports {eth_txd[0]}]
set_property PACKAGE_PIN A16 [get_ports {eth_txd[1]}]
set_property PACKAGE_PIN B17 [get_ports {eth_txd[2]}]
set_property PACKAGE_PIN B16 [get_ports {eth_txd[3]}]
set_property PACKAGE_PIN B21 [get_ports eth_rx_ctl]
set_property PACKAGE_PIN B19 [get_ports eth_rxc]
set_property PACKAGE_PIN A18 [get_ports eth_tx_ctl]
set_property PACKAGE_PIN A19 [get_ports eth_txc]
set_property PACKAGE_PIN AB17 [get_ports MDIO_PHY_1_mdc]
set_property PACKAGE_PIN Y14 [get_ports MDIO_PHY_1_mdio_io]
set_property PACKAGE_PIN Y6 [get_ports RGMII_1_rxc]
set_property PACKAGE_PIN AB2 [get_ports RGMII_1_rx_ctl]
set_property PACKAGE_PIN AA7 [get_ports RGMII_1_tx_ctl]
set_property PACKAGE_PIN AA6 [get_ports RGMII_1_txc]
set_property PACKAGE_PIN AB5 [get_ports {RGMII_1_rd[3]}]
set_property PACKAGE_PIN AB4 [get_ports {RGMII_1_rd[2]}]
set_property PACKAGE_PIN Y4 [get_ports {RGMII_1_rd[1]}]
set_property PACKAGE_PIN AA4 [get_ports {RGMII_1_rd[0]}]
set_property PACKAGE_PIN AA9 [get_ports {RGMII_1_td[3]}]
set_property PACKAGE_PIN AA8 [get_ports {RGMII_1_td[2]}]
set_property PACKAGE_PIN AB10 [get_ports {RGMII_1_td[1]}]
set_property PACKAGE_PIN AB9 [get_ports {RGMII_1_td[0]}]

set_property IOSTANDARD LVCMOS33 [get_ports {led[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {led[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports eth_mdc]
set_property IOSTANDARD LVCMOS33 [get_ports eth_mdio]
set_property IOSTANDARD LVCMOS33 [get_ports eth_rst_n]
set_property IOSTANDARD LVCMOS33 [get_ports {eth_rxd[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {eth_rxd[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {eth_rxd[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {eth_rxd[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {eth_txd[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {eth_txd[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {eth_txd[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {eth_txd[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports eth_rx_ctl]
set_property IOSTANDARD LVCMOS33 [get_ports eth_rxc]
set_property IOSTANDARD LVCMOS33 [get_ports eth_tx_ctl]
set_property IOSTANDARD LVCMOS33 [get_ports eth_txc]
set_property IOSTANDARD LVCMOS33 [get_ports RGMII_1_rxc]
set_property IOSTANDARD LVCMOS33 [get_ports MDIO_PHY_1_mdc]
set_property IOSTANDARD LVCMOS33 [get_ports MDIO_PHY_1_mdio_io]
set_property IOSTANDARD LVCMOS33 [get_ports {RGMII_1_rd[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {RGMII_1_rd[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {RGMII_1_rd[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {RGMII_1_rd[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports {RGMII_1_td[3]}]
set_property IOSTANDARD LVCMOS33 [get_ports {RGMII_1_td[2]}]
set_property IOSTANDARD LVCMOS33 [get_ports {RGMII_1_td[1]}]
set_property IOSTANDARD LVCMOS33 [get_ports {RGMII_1_td[0]}]
set_property IOSTANDARD LVCMOS33 [get_ports RGMII_1_rx_ctl]
set_property IOSTANDARD LVCMOS33 [get_ports RGMII_1_tx_ctl]
set_property IOSTANDARD LVCMOS33 [get_ports RGMII_1_txc]

set_property SLEW FAST [get_ports {eth_txd[3]}]
set_property SLEW FAST [get_ports {eth_txd[2]}]
set_property SLEW FAST [get_ports {eth_txd[1]}]
set_property SLEW FAST [get_ports {eth_txd[0]}]
set_property SLEW FAST [get_ports eth_tx_ctl]
set_property SLEW FAST [get_ports eth_txc]
set_property SLEW FAST [get_ports {RGMII_1_td[3]}]
set_property SLEW FAST [get_ports {RGMII_1_td[2]}]
set_property SLEW FAST [get_ports {RGMII_1_td[1]}]
set_property SLEW FAST [get_ports {RGMII_1_td[0]}]
set_property SLEW FAST [get_ports RGMII_1_tx_ctl]
set_property SLEW FAST [get_ports RGMII_1_txc]
